# Script

In [1]:
import numpy as np
import pandas as pd

## ICUp5NewWindow24

In [2]:
df_window = pd.read_csv('./data/output/ICUp5NewWindow24.csv')
df_window.head(3)

   subject_id  day           start_time             end_time  diff_end_start
0    12088486    1  2135-02-07 03:03:00  2135-02-08 03:03:00            24.0
1    12088486    2  2135-02-08 03:03:00  2135-02-09 03:03:00            24.0
2    12088486    3  2135-02-09 03:03:00  2135-02-10 03:03:00            24.0

In [3]:
df_window.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 63005 entries, 0 to 63004
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subject_id      63005 non-null  int64
 1   day             63005 non-null  int64
 2   start_time      63005 non-null  object
 3   end_time        63005 non-null  object
 4   diff_end_start  63005 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 2.4+ MB

In [4]:
df_window.describe().T

,count,mean,std,min,25%,50%,75%,max
subject_id,63005.0,1.506537e+07,2.875203e+06,10001884.0,12621244.0,15153936.0,17541976.0,19999840.0
day,63005.0,7.655091e+00,8.127624e+00,1.0,3.0,5.0,10.0,100.0
diff_end_start,63005.0,2.337211e+01,3.011440e+00,6.0,24.0,24.0,24.0,29.0

In [5]:
data_types = {
    'subject_id': 'int64',
    'day': 'int64',
    'start_time': 'datetime',
    'end_time': 'datetime'
}

In [6]:
correct_format = '%Y-%m-%d %H:%M:%S'

for col, dtype in data_types.items():
    if dtype == 'datetime':
        df_window[col] = pd.to_datetime(df_window[col], format=correct_format)
    else:
        df_window[col] = df_window[col].astype(dtype)

### A partir desse ponto iremos realizar os procedimentos referentes as extrações específicas

In [7]:
df_window.loc[:, 'hemodialysis'] = 0

## ICUp5procedureevents

In [8]:
df_procedureevents = pd.read_csv('./data/input/ICUp5procedureevents.csv')
df_procedureevents = df_procedureevents.query('itemid == 225441')
df_procedureevents.head(3)

,subject_id,hadm_id,stay_id,caregiver_id,starttime,endtime,storetime,itemid,value,valueuom,...,orderid,linkorderid,ordercategoryname,ordercategorydescription,patientweight,isopenbag,continueinnextdept,statusdescription,originalamount,originalrate
24,11592303,26632693,30117157,40703.0,2152-03-22 09:00:00.000000 UTC,2152-03-22 13:00:00.000000 UTC,2152-03-22 09:28:00.000000 UTC,225441,4.0,hour,...,5235845,5235845,Continuous Procedures,ContinuousProcess,42.0,0,0,FinishedRunning,4.0,1
33,18867021,28092989,38319765,NaN,2174-09-05 12:00:00.000000 UTC,2174-09-05 22:10:00.000000 UTC,2174-09-05 22:10:18.020000 UTC,225441,610.0,min,...,8739326,8739326,Continuous Procedures,ContinuousProcess,46.0,1,0,FinishedRunning,610.0,1
37,11802884,23555595,32191008,85606.0,2159-04-20 09:00:00.000000 UTC,2159-04-20 11:00:00.000000 UTC,2159-04-20 14:24:00.000000 UTC,225441,120.0,min,...,5731176,5731176,Continuous Procedures,ContinuousProcess,46.0,1,0,FinishedRunning,120.0,1

In [9]:
df_procedureevents.info()

<class 'pandas.core.frame.DataFrame'>
Index: 921 entries, 24 to 8034
Data columns (total 22 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   subject_id                921 non-null    int64
 1   hadm_id                   921 non-null    int64
 2   stay_id                   921 non-null    int64
 3   caregiver_id              835 non-null    float64
 4   starttime                 921 non-null    object
 5   endtime                   921 non-null    object
 6   storetime                 921 non-null    object
 7   itemid                    921 non-null    int64
 8   value                     921 non-null    float64
 9   valueuom                  921 non-null    object
 10  location                  0 non-null      object
 11  locationcategory          0 non-null      object
 12  orderid                   921 non-null    int64
 13  linkorderid               921 non-null    int64
 14  ordercategoryname         921 non-null    object
 15  ordercategorydescription  921 non-null    object
 16  patientweight             921 non-null    float64
 17  isopenbag                 921 non-null    int64
 18  continueinnextdept        921 non-null    int64
 19  statusdescription         921 non-null    object
 20  originalamount            921 non-null    float64
 21  originalrate              921 non-null    int64
dtypes: float64(4), int64(9), object(9)
memory usage: 165.5+ KB

In [10]:
data_types = {
    'subject_id': 'int64',
    'hadm_id': 'int64',
    'stay_id': 'int64',
    'starttime': 'datetime',
    'endtime': 'datetime',
    'storetime': 'datetime',
    'value': 'float64',
    'valueuom': 'category',
}

In [11]:
correct_format = '%Y-%m-%d %H:%M:%S.%f UTC'

for col, dtype in data_types.items():
    if dtype == 'datetime':
        df_procedureevents[col] = pd.to_datetime(df_procedureevents[col], format=correct_format)
    else:
        df_procedureevents[col] = df_procedureevents[col].astype(dtype)

In [12]:
df_procedureevents = df_procedureevents[data_types.keys()]

In [13]:
df_procedureevents.head(1)

,subject_id,hadm_id,stay_id,starttime,endtime,storetime,value,valueuom
24,11592303,26632693,30117157,2152-03-22 09:00:00,2152-03-22 13:00:00,2152-03-22 09:28:00,4.0,hour

In [14]:
for subject_id in df_procedureevents.subject_id.unique():
    if df_window[df_window.subject_id == subject_id].shape[0]:
        storetime = df_procedureevents[df_procedureevents.subject_id == subject_id].storetime.to_list()
        
        df_temp = df_window[df_window.subject_id == subject_id]
        df_temp = df_temp[df_temp.end_time.notnull()]
        
        for item in storetime:
            for index, row in df_temp.iterrows():
                if row.start_time <= item <= row.end_time:
                    df_window.loc[index, 'hemodialysis'] += 1

## ICUpatients5

In [15]:
df_patients = pd.read_csv('./data/input/ICUpatients5.csv')
df_patients.head(3)

,subject_id,hadm_id,stay_id,gender,anchor_age,admittime,intime,outtime,deathtime,intervaloAdmIntUTI,tempoUTI,race,pesoadm,unidpesoadm,altura,unidaltura,imc
0,12088486,29875103,39348271,M,18,2135-02-07 02:57:00 UTC,2135-02-07 03:03:00 UTC,2135-02-12 00:25:00 UTC,2135-02-11 00:01:00 UTC,0,117,UNABLE TO OBTAIN,71.8,kg,178.0,cm,-99.9
1,19850244,27972658,32398411,F,18,2162-06-04 17:38:00 UTC,2162-06-05 15:25:42 UTC,2162-06-09 20:22:03 UTC,NaN,21,100,OTHER,57.7,kg,163.0,cm,-99.9
2,10562205,20149612,34317198,M,18,2149-04-29 23:19:00 UTC,2149-04-30 00:58:00 UTC,2149-05-09 20:54:46 UTC,NaN,1,235,WHITE,98.0,kg,180.0,cm,-99.9

In [16]:
data_types = {
    'subject_id': 'int64',
    'intime': 'datetime',
    'outtime': 'datetime',
}

In [17]:
correct_format = '%Y-%m-%d %H:%M:%S UTC'

for col, dtype in data_types.items():
    if dtype == 'datetime':
        df_patients[col] = pd.to_datetime(df_patients[col], format=correct_format)
    else:
        df_patients[col] = df_patients[col].astype(dtype)
        
df_patients = df_patients[data_types.keys()]

In [18]:
df_patients.loc[:, 'total_hemodialysis'] = 0
df_patients.loc[:, 'hemodialysis'] = 0

In [19]:
def get_total_hemodialysis(row: pd.Series) -> int:
    subject_id = row.subject_id
    
    return df_window[df_window.subject_id == subject_id].hemodialysis.sum()

def get_hemodialysis(row: pd.Series) -> int:
    '''
        1 - se realizou hemodiálise ao longo do internamento;
        0 - se não realizou hemodiálise ao longo do internamento.
    '''
    return 1 if row['total_hemodialysis'] else 0

In [20]:
df_patients.loc[:, 'total_hemodialysis'] = df_patients.apply(get_total_hemodialysis, axis=1)

In [21]:
df_patients.loc[:, 'hemodialysis'] = df_patients.apply(get_hemodialysis, axis=1)

In [22]:
df_patients.sort_values('total_hemodialysis', ascending=False).head(3)

,subject_id,intime,outtime,total_hemodialysis,hemodialysis
222,15479539,2138-05-25 01:01:36,2138-07-30 15:02:54,19,1
851,11129835,2154-05-18 13:11:47,2154-07-18 13:42:25,13,1
5726,12306709,2141-04-16 11:21:07,2141-05-29 11:26:04,12,1

In [23]:
df_patients.sort_values('hemodialysis', ascending=False).head(3)

,subject_id,intime,outtime,total_hemodialysis,hemodialysis
1920,17710225,2160-11-10 14:08:06,2160-12-05 18:12:37,4,1
851,11129835,2154-05-18 13:11:47,2154-07-18 13:42:25,13,1
836,11458288,2142-12-11 17:53:29,2143-01-02 21:16:11,1,1

## Finalizando

In [24]:
df_final = df_patients.reset_index()[['subject_id', 'intime', 'outtime', 'total_hemodialysis', 'hemodialysis']]
df_final.head()

,subject_id,intime,outtime,total_hemodialysis,hemodialysis
0,12088486,2135-02-07 03:03:00,2135-02-12 00:25:00,0,0
1,19850244,2162-06-05 15:25:42,2162-06-09 20:22:03,0,0
2,10562205,2149-04-30 00:58:00,2149-05-09 20:54:46,0,0
3,17840418,2129-01-14 08:00:00,2129-01-17 16:52:18,0,0
4,17590005,2134-03-03 03:47:56,2134-03-06 16:58:23,0,0

In [25]:
df_final.to_csv('./data/output/ICUp5Hemodialysis.csv', index=False)